# FamilyNoExternalParametersError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..FamilyNoExternalParametersError Property
BuiltInFailures..::..FamilyFailures Class See Also
---
Family's Category can't be changed because the Family contains Shared Parameters which are not permitted in the new Category.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FamilyNoExternalParametersError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FamilyNoExternalParametersError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FamilyNoExternalParametersError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace